benchmark.yml
config:
  target: http://localhost:8080
  phases:
    - duration: 60
      arrivalRate: 150
      name: benchmark warm up
    - duration: 60
      arrivalRate: 300
      name: benchmark spike
scenarios:
  - flow:
    - get:
        url: "/benchmark?n=800"
        expect:
          - equals:
            - "OK"