benchmark.yml
config:
  target: http://localhost:8080
  phases:
    - duration: 60
      arrivalRate: 400
      name: benchmark warm up
    - duration: 60
      arrivalRate: 550
      name: benchmark spike
scenarios:
  - flow:
    - get:
        url: "/benchmark?n=1"
        expect:
          - equals:
            - "OK"